#Дано трехзначное число. Вывести число, полученное при
#перестановке цифр десятков и единиц исходного числа (например, 123 перейдет в 132).
    #Ввод трехзначного числа
try:
    number = int(input("Введите трехзначное число:"))
    #Проверяем является ли это число трехзначным
    if 100 <= number <= 999:
        hundreds = number // 100
        tens = (number // 10) % 10
        units = number % 10
        result = hundreds * 100 + units * 10 + tens
        print("Полученное число:", result)
    else:
        print("Ошибка! Число должно быть трехзначным")
except SyntaxError:
    print("Ошибка! введите целое число")